# Написати функцію, яка приймає два параметри:
# ім'я файлу та кількість символів.
# На екран повинен вивестись список із трьома
# блоками - символи з початку, із середини та
# з кінця файлу.
# Кількість символів в блоках - та, яка введена
# в другому параметрі.
# Придумайте самі, як обробляти помилку, наприклад,
# коли кількість символів більша, ніж є в файлі
# (наприклад, файл із двох символів і треба вивести
# по одному символу, то що виводити на місці
# середнього блоку блоку символів?)
# В репозиторій додайте і ті файли, по яким робили
# тести.
# Як визначити середину файлу (з якої брать
# необхідні символи) - кількість символів поділити
# навпіл, а отримане "вікно" символів відцентрувати
# щодо середини файла і взяти необхідну кількість.
# В разі необхідності заокруглення одного чи обох
# параметрів - дивіться на свій розсуд.

import json

def start(filename, symbols):
	with open(filename, 'r') as f:
		text = json.load(f)
	s = []	
	for i in text:
		s.append(i)	
	a = len(text)
	b = len(text) // 3
	c = len(text) % 3
	left = []
	middle = []
	right = []
	if c == 0:
		left = s[0:b-1]
		middle = s[b:a-b]
		right = s[a-b:a-1]
	if c == 1:
		left = s[0:b-1]
		middle = s[b:a-b]
		right = s[a-b:a-1]
	if c == 2:
		left = s[0:b]
		middle = s[b+1:a-b-2]
		right = s[a-b-1:a-1]
	print(f'Left: {left}.')
	print(f'Middle: {middle}.')
	print(f'Right: {right}.')

start('test.txt', 1)		
